{
  "about": {
    "title": "Acerca de devs.",
    "mision": {
      "title": "Mi misión",
      "description": "Devs es una plataforma dedicada a conectar a desarrolladores de todo el mundo. Mi objetivo es crear un espacio donde los desarrolladores puedan compartir ideas, aprender y colaborar en proyectos apasionantes. Desde artículos hasta desafíos interactivos, busco ofrecer recursos útiles para mejorar las habilidades técnicas y mantenerse al día con las últimas tendencias en el mundo del desarrollo web."
    },
    "vision": {
      "title": "Visión",
      "description": "Mi visión es ser una plataforma de colaboración y aprendizaje para desarrolladores en todo el mundo. Quiero ser el lugar donde los desarrolladores de todas las edades y habilidades se encuentren, aprendan y crezcan juntos."
    },
    "aboutMe": {
      "title": "Sobre mí",
      "description": "Devs fue creada por mí, Ignacio Figueroa, desarrollador web. Siempre en busca de aprender y compartir conocimientos sobre las últimas tecnologías, creo firmemente en el poder de la comunidad para mejorar las habilidades de todos."
    },
    "myValues": {
      "title": "Mis valores",
      "items": [
        {
          "title": "Colaboración",
          "description": "Fomento un ambiente donde todos pueden aportar, aprender y crecer juntos."
        },
        {
          "title": "Innovación",
          "description": "Siempre busco ofrecer recursos y herramientas innovadoras para mantener a la comunidad al día con las últimas tendencias tecnológicas."
        },
        {
          "title": "Accesibilidad",
          "description": "Mi objetivo es que todos, sin importar su experiencia, tengan acceso a las mismas oportunidades de aprender y mejorar."
        },
        {
          "title": "Comunidad",
          "description": "Creo en el poder de las conexiones y en el valor de la colaboración para mejorar como profesionales."
        }
      ]
    },
    "join": {
      "title": "Unete a devs!",
      "description": "Tengo muchas ganas de construir una comunidad increíble de desarrolladores! Si eres un desarrollador apasionado por aprender y compartir, te invito a unirte a la plataforma y ser parte. Regístrate hoy mismo y empieza a conectar con otros desarrolladores.",
      "action": "¡Regístrate ahora!"
    },
    "contact": {
      "title": "Contacto",
      "description": "Si tienes alguna pregunta o sugerencia, no dudes en ponerte en contacto conmigo a través del siguiente correo electrónico:"
    }
  },
  "register": {
    "title": "Registrate en devs",
    "fields": {
      "name": {
        "label": "Nombre",
        "description": "Este es el nombre que se mostrará en tu perfil.",
        "errors": {
          "minCharacters": "El nombre debe tener al menos 2 caracteres.",
          "maxCharacters": "El nombre no debe tener más de 30 caracteres.",
          "allowedCharacters": "El nombre solo puede contener letras y espacios."
        }
      },
      "email": {
        "label": "Correo electrónico",
        "description": "Tu correo electrónico nunca será compartido con nadie.",
        "errors": {
          "validEmail": "Por favor, introduce una dirección de correo electrónico válida."
        }
      },
      "password": {
        "label": "Contraseña",
        "description": "Tu contraseña debe tener al menos 8 caracteres.",
        "errors": {
          "minCharacters": "La contraseña debe tener al menos 8 caracteres.",
          "maxCharacters": "La contraseña no debe tener más de 50 caracteres.",
          "shouldIncludeOneLetter": "La contraseña debe incluir al menos una letra.",
          "shouldIncludeOneNumber": "La contraseña debe incluir al menos un número."
        }
      }
    },
    "submit": "Registrarse",
    "submitting": "Registrando...",
    "haveAccount": "¿Y tienes una cuenta?",
    "login": "Iniciar Sesión"
  },
  "login": {
    "title": "Iniciar sesión en devs",
    "email": {
      "label": "Correo electrónico",
      "placeholder": "juanperez@ejemplo.com",
      "error": {
        "required": "El correo electrónico es obligatorio",
        "invalid": "Por favor, introduce una dirección de correo electrónico válida"
      }
    },
    "password": {
      "label": "Contraseña",
      "placeholder": "Introduce tu contraseña",
      "error": {
        "required": "La contraseña es obligatoria",
        "min": "La contraseña debe tener al menos {min} caracteres"
      }
    },
    "submit": "Iniciar sesión",
    "submitting": "Iniciando sesión...",
    "forgotPassword": "¿Olvidaste tu contraseña?",
    "noAccount": "¿No tienes una cuenta?",
    "signUp": "Regístrate",
    "success": {
      "title": "Inicio de sesión exitoso",
      "description": "¡Bienvenido de vuelta a devs!"
    },
    "error": {
      "title": "Error de inicio de sesión",
      "description": "Por favor, verifica tus credenciales e intenta de nuevo."
    }
  }
}
