{
  "about": {
    "title": "About devs.",
    "mision": {
      "title": "My mission",
      "description": "Devs is a platform dedicated to connecting developers from all over the world. My goal is to create a space where developers can share ideas, learn, and collaborate on exciting projects. From articles to interactive challenges, I aim to offer useful resources to improve technical skills and stay up-to-date with the latest trends in the world of web development."
    },
    "vision": {
      "title": "Vision",
      "description": "My vision is to be a platform for collaboration and learning for developers worldwide. I want to be the place where developers of all ages and skill levels can meet, learn, and grow together."
    },
    "aboutMe": {
      "title": "About me",
      "description": "Devs was created by me, Ignacio Figueroa, a web developer. Always seeking to learn and share knowledge about the latest technologies, I firmly believe in the power of community to improve everyone’s skills."
    },
    "myValues": {
      "title": "My values",
      "items": [
        {
          "title": "Collaboration",
          "description": " I foster an environment where everyone can contribute, learn, and grow together."
        },
        {
          "title": "Innovation",
          "description": "I am always looking to offer innovative resources and tools to keep the community up-to-date with the latest technological trends."
        },
        {
          "title": "Accessibility",
          "description": " My goal is for everyone, regardless of experience, to have access to the same opportunities to learn and improve."
        },
        {
          "title": "Community",
          "description": "I believe in the power of connections and the value of collaboration to improve as professionals."
        }
      ]
    },
    "join": {
      "title": "Join devs!",
      "description": "I’m excited to build an incredible community of developers! If you are a developer passionate about learning and sharing, I invite you to join the platform and be part of it. Sign up today and start connecting with other developers.",
      "action": "Register now!"
    },
    "contact": {
      "title": "Contact",
      "description": "If you have any questions or suggestions, feel free to contact me via the following email:"
    }
  },
  "register": {
    "title": "Register for devs",
    "fields": {
      "name": {
        "label": "Name",
        "description": "This is the name that will be displayed on your profile.",
        "errors": {
          "minCharacters": "Name must be at least 2 characters long.",
          "maxCharacters": "Name must be at most 30 characters long.",
          "allowedCharacters": "Name can only contain letters and spaces."
        }
      },
      "email": {
        "label": "Email",
        "description": "Your email will never share to no one",
        "errors": {
          "validEmail": "Please enter a valid email address."
        }
      },
      "password": {
        "label": "Password",
        "description": "Your password must be at least 8 characters long.",
        "errors": {
          "minCharacters": "Password must be at least 2 characters long.",
          "maxCharacters": "Password must be at most 50 characters long.",
          "shouldIncludeOneLetter": "Password must include at least one letter.",
          "shouldIncludeOneNumber": "Password must include at least one Number."
        }
      }
    },
    "submit": "Submit",
    "submitting": "Submitting...",
    "haveAccount": "Already have an account?",
    "login": "Login"
  },
  "login": {
    "title": "Log in to devs",
    "email": {
      "label": "Email",
      "error": {
        "required": "Email is required",
        "invalid": "Please enter a valid email address"
      }
    },
    "password": {
      "label": "Password",
      "placeholder": "Enter your password",
      "error": {
        "required": "Password is required",
        "min": "Password must be at least {min} characters"
      }
    },
    "submit": "Log in",
    "submitting": "Logging in...",
    "forgotPassword": "Forgot password?",
    "noAccount": "Don't have an account?",
    "signUp": "Sign up",
    "success": {
      "title": "Login Successful",
      "description": "Welcome back to devs!"
    },
    "error": {
      "title": "Login Failed",
      "description": "Please check your credentials and try again."
    }
  }
}
